Revit 2027 API
FaceEdgeNode Methods
The FaceEdgeNode type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFaceEdge |  Returns the Face edge object corresponding to the node.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInstanceTransform |  Returns instance transform of the object being drawn.
(Inherited from FaceDetailNode)
GetLinkTransform |  Returns link transform of the object being drawn.
(Inherited from FaceDetailNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FaceEdgeNode Class
Autodesk.Revit.DB Namespace